note/drawio/converted/dot/260420-timepiece.dot
digraph G {
  graph [rankdir=LR];
  node [shape=box, style="rounded,filled", fillcolor="#f8f9fb", color="#5b6b7a", fontname="Arial"];
  "n_KnFHKVMMht0ZCSLNLWhT_100" [label="i_btnD"];
  "n_KnFHKVMMht0ZCSLNLWhT_101" [label="i_btnD_hold"];
  "n_KnFHKVMMht0ZCSLNLWhT_103" [label="i_btnR_hold"];
  "n_KnFHKVMMht0ZCSLNLWhT_18" [label="timepiece_datapath"];
  "n_KnFHKVMMht0ZCSLNLWhT_19" [label="tick_gen _100hz"];
  "n_KnFHKVMMht0ZCSLNLWhT_20" [label="msec_tick_count"];
  "n_KnFHKVMMht0ZCSLNLWhT_21" [label="sec_tick_count"];
  "n_KnFHKVMMht0ZCSLNLWhT_25" [label="min_tick_count"];
  "n_KnFHKVMMht0ZCSLNLWhT_26" [label="hour_tick_count"];
  "n_KnFHKVMMht0ZCSLNLWhT_28" [label="100Hz tick"];
  "n_KnFHKVMMht0ZCSLNLWhT_29" [label="o_sec_tick"];
  "n_KnFHKVMMht0ZCSLNLWhT_30" [label="i_tick"];
  "n_KnFHKVMMht0ZCSLNLWhT_31" [label="o_hour_tick"];
  "n_KnFHKVMMht0ZCSLNLWhT_32" [label="i_tick"];
  "n_KnFHKVMMht0ZCSLNLWhT_37" [label="o_min_tick"];
  "n_KnFHKVMMht0ZCSLNLWhT_38" [label="i_tick"];
  "n_KnFHKVMMht0ZCSLNLWhT_39" [label="7"];
  "n_KnFHKVMMht0ZCSLNLWhT_4" [label="timepiece_fsm"];
  "n_KnFHKVMMht0ZCSLNLWhT_40" [label="6"];
  "n_KnFHKVMMht0ZCSLNLWhT_41" [label="5"];
  "n_KnFHKVMMht0ZCSLNLWhT_5" [label="node_LWhT-5"];
  "n_KnFHKVMMht0ZCSLNLWhT_64" [label="24"];
  "n_KnFHKVMMht0ZCSLNLWhT_66" [label="w_decrement"];
  "n_KnFHKVMMht0ZCSLNLWhT_67" [label="w_increment"];
  "n_KnFHKVMMht0ZCSLNLWhT_68" [label="w_index_shift"];
  "n_KnFHKVMMht0ZCSLNLWhT_69" [label="w_set_mode"];
  "n_KnFHKVMMht0ZCSLNLWhT_70" [label="w_set_index"];
  "n_KnFHKVMMht0ZCSLNLWhT_72" [label="time_set_module"];
  "n_KnFHKVMMht0ZCSLNLWhT_74" [label="w_set_msec"];
  "n_KnFHKVMMht0ZCSLNLWhT_76" [label="w_set_sec"];
  "n_KnFHKVMMht0ZCSLNLWhT_78" [label="w_set_min"];
  "n_KnFHKVMMht0ZCSLNLWhT_80" [label="w_set_hour"];
  "n_KnFHKVMMht0ZCSLNLWhT_87" [label="w_set_mode"];
  "n_KnFHKVMMht0ZCSLNLWhT_88" [label="w_timepiiecer_value"];
  "n_KnFHKVMMht0ZCSLNLWhT_91" [label="24"];
  "n_KnFHKVMMht0ZCSLNLWhT_92" [label="o_timepiecer_value"];
  "n_KnFHKVMMht0ZCSLNLWhT_97" [label="i_btnL"];
  "n_KnFHKVMMht0ZCSLNLWhT_98" [label="i_btnU"];
  "n_KnFHKVMMht0ZCSLNLWhT_99" [label="i_btnU_hold"];
  "n_aIL1LXi5LiADFW6FzjM5_2" [label="i_sw0"];
  "n_KnFHKVMMht0ZCSLNLWhT_20" -> "n_KnFHKVMMht0ZCSLNLWhT_21";
  "n_KnFHKVMMht0ZCSLNLWhT_21" -> "n_KnFHKVMMht0ZCSLNLWhT_25";
  "n_KnFHKVMMht0ZCSLNLWhT_25" -> "n_KnFHKVMMht0ZCSLNLWhT_26";
  "n_KnFHKVMMht0ZCSLNLWhT_4" -> "n_KnFHKVMMht0ZCSLNLWhT_72";
  "n_KnFHKVMMht0ZCSLNLWhT_4" -> "n_KnFHKVMMht0ZCSLNLWhT_72";
  "n_KnFHKVMMht0ZCSLNLWhT_4" -> "n_KnFHKVMMht0ZCSLNLWhT_72";
  "n_KnFHKVMMht0ZCSLNLWhT_4" -> "n_KnFHKVMMht0ZCSLNLWhT_72";
  "n_KnFHKVMMht0ZCSLNLWhT_72" -> "n_KnFHKVMMht0ZCSLNLWhT_26";
}
